from gtts import gTTS
import os

# ข้อความที่ต้องการแปลงเป็นเสียง
text = "อาณาจักรศักดิ์สิทธิ์โรเบิลเป็นประเทศที่มีอาณาเขตอยู่ที่คาบสมุทรทางตะวันตกเฉียงใต้ของอาณาจักร Re-Estize มีผู้นำโดยราชินีผู้ศักดิ์สิทธิ์ ที่สามารถใช้เวทมนตร์ศักดิ์สิทธิ์ได้ และความเป็นผู้นำนั้นเชื่อมโยงอย่างใกล้ชิดกับฝ่ายศาสนจักร มันเป็นประเทศที่เคร่งศาสนามาก แม้ว่าจะไม่อยู่ใกล้ขอบเขตของอาณาจักรสเลนก็ตาม. "

# เลือกภาษาให้กับ TTS
language = 'th'  # ภาษาไทย

# สร้างเสียงจากข้อความ
tts = gTTS(text=text, lang=language, slow=False)

# บันทึกไฟล์เสียงเป็น MP3
tts.save("output.mp3")

# เล่นไฟล์เสียงที่สร้างขึ้น
os.system("start output.mp3")
